IDEA StatiCa Open Model
ProjectDataEc.FatigueCheck Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 To allow fatigue check
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool FatigueCheck { get; set; }
Public Property FatigueCheck As Boolean
	Get
	Set
public:
property bool FatigueCheck {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
ProjectDataEc Class
IdeaRS.OpenModel Namespace